# Lab Assignment 9: Data Management Using `pandas`, Part 2
## DS 6001: Practice and Application of Data Science
- Name: Congxin (David) Xu
- Computing ID: cx2rx
- Breakout Room: 14


### Instructions
Please answer the following questions as completely as possible using text, code, and the results of code as needed. Format your answers in a Jupyter notebook. To receive full credit, make sure you address every part of the problem, and make sure your document is formatted in a clean and professional way.

## Problem 0
Import the following libraries:

In [1]:
import numpy as np
import pandas as pd

## Problem 1
In the first part of this lab, the goal is to merge data from the United Nations World Health Organization (https://www.who.int/who-un/en/) with data from the Varieties of Democracy Project (https://www.v-dem.net/en/). The UN-WHO studies health outcomes in a cross-national context, and V-Dem studies the quality of democracy as it changes across countries and over time, We would want to merge these two datasets together if we wanted to study whether democratic quality can predict health outcomes.

The UN data contains cross-national time series data from the United Nations and World Health Organization, and includes three features:

* The number of physicians per 1000 people
* The percent of the population that is malnourished
* Health expenditure per capita

The VDem data comes from the Varieties of Democracy project, which aims to measure the quality of democracy and the amount of corruption in different countries over time (https://www.v-dem.net/en/data/data-version-8/). This data file contains indices regarding a country’s democractic quality, level of civil liberites, and corruption. It also contains a binary indicator that separates countries into democratic and nondemocratic states, and it includes a categorizaton of the corruption scale.

The URLs for the two datasets are:

In [2]:
undata_url = "https://github.com/jkropko/DS-6001/raw/master/localdata/UNdata.csv"
VDem_url = "https://github.com/jkropko/DS-6001/raw/master/localdata/vdem.csv"

### Part a
Load both CSV files. Make sure to check whether there are rows that should not be included in the dataframe, and whether there are missing codes that should be replaced with `NaN`. Fix these problems at the data loading stage, if you can. (Don't worry about column names or category labels yet.) Also, the UN data covers the years 1960-2014, and the VDem data covers the years 1960-2015. To make the timeframe match up, delete rows in the VDem data from 2015. (1 point)

In [3]:
## Read in the UN data, skip the last 5 rows
undata = pd.read_csv(undata_url, skipfooter = 5, engine = 'python')

## Replace values '..' with NaN
undata[undata.columns] = undata[undata.columns].replace(['..'], np.nan)
undata.drop('2015 [YR2015]', axis = 1)
undata.head()

,Series Name,Series Code,Country Name,Country Code,1960 [YR1960],1961 [YR1961],1962 [YR1962],1963 [YR1963],1964 [YR1964],1965 [YR1965],...,2006 [YR2006],2007 [YR2007],2008 [YR2008],2009 [YR2009],2010 [YR2010],2011 [YR2011],2012 [YR2012],2013 [YR2013],2014 [YR2014],2015 [YR2015]
0,"Physicians (per 1,000 people)",SH.MED.PHYS.ZS,Afghanistan,AFG,0.0348442494869232,NaN,NaN,NaN,NaN,0.0634277984499931,...,0.136,0.146,0.145,0.175,0.194,0.234,0.225,0.266,NaN,NaN
1,"Physicians (per 1,000 people)",SH.MED.PHYS.ZS,Albania,ALB,0.276291221380234,NaN,NaN,NaN,NaN,0.48128342628479,...,1.15,1.146,NaN,1.144,1.132,1.113,1.145,1.145,NaN,NaN
2,"Physicians (per 1,000 people)",SH.MED.PHYS.ZS,Algeria,DZA,0.173148155212402,NaN,NaN,NaN,NaN,0.116413652896881,...,NaN,1.207,NaN,NaN,1.207,NaN,NaN,NaN,NaN,NaN
3,"Physicians (per 1,000 people)",SH.MED.PHYS.ZS,American Samoa,ASM,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,"Physicians (per 1,000 people)",SH.MED.PHYS.ZS,Andorra,ADO,NaN,NaN,NaN,NaN,NaN,NaN,...,3.64,3.716,NaN,3.912,4,NaN,NaN,NaN,NaN,NaN

In [4]:
# Read in the VDem data
VDem = pd.read_csv(VDem_url)

# Remove rows from 2015
VDem = VDem[VDem["year"] != 2015]

VDem.head()

,X1,country_name,country_id,country_text_id,year,historical_date,codingstart,gapstart,gapend,codingend,...,v2xcs_ccsi_codehigh,v2xcs_ccsi_codelow,v2xps_party,v2xps_party_codehigh,v2xps_party_codelow,v2x_gender,v2x_gender_codehigh,v2x_gender_codelow,v2x_gencl,v2x_gencl_codehigh
0,1,Mexico,3,MEX,1960,1960-01-01,1900,NaN,NaN,2014,...,0.451123,0.170201,0.681416,0.811379,0.524055,0.347498,0.421270,0.273726,0.555367,0.714971
1,2,Mexico,3,MEX,1961,1961-01-01,1900,NaN,NaN,2014,...,0.461693,0.175715,0.681416,0.811379,0.524055,0.344214,0.417813,0.270614,0.555367,0.714971
2,3,Mexico,3,MEX,1962,1962-01-01,1900,NaN,NaN,2014,...,0.461693,0.175715,0.681416,0.811379,0.524055,0.344214,0.417813,0.270614,0.555367,0.714971
3,4,Mexico,3,MEX,1963,1963-01-01,1900,NaN,NaN,2014,...,0.461693,0.175715,0.681416,0.811379,0.524055,0.344214,0.417813,0.270614,0.555367,0.714971
4,5,Mexico,3,MEX,1964,1964-01-01,1900,NaN,NaN,2014,...,0.461693,0.175715,0.681416,0.811379,0.524055,0.356873,0.428861,0.284885,0.555367,0.714971

### Part b
The UN data contain certain rows that refer to groups of countries instead of to individual countries. Here’s a list of these non-countries:

In [5]:
noncountries = ['Arab World',  'Caribbean small states',  'Central Europe and the Baltics', 
                'Early-demographic dividend',  'East Asia & Pacific', 'East Asia & Pacific (excluding high income)', 
                'East Asia & Pacific (IDA & IBRD countries)', 'Euro area', 'Europe & Central Asia', 
                'Europe & Central Asia (excluding high income)', 'Europe & Central Asia (IDA & IBRD countries)', 
                'European Union', 'Fragile and conflict affected situations', 'Heavily indebted poor countries (HIPC)', 
                'High income', 'Late-demographic dividend', 'Latin America & Caribbean', 
                'Latin America & Caribbean (excluding high income)', 'Latin America & the Caribbean (IDA & IBRD countries)', 
                'Least developed countries: UN classification', 'Low & middle income', 'Low income', 'Lower middle income', 
                'Middle East & North Africa', 'Middle East & North Africa (excluding high income)',
                'Middle East & North Africa (IDA & IBRD countries)',  'Middle income', 'North America', 'OECD members', 
                'Other small states', 'Pacific island small states', 'Post-demographic dividend', 'Pre-demographic dividend',
                'Small states', 'South Asia', 'South Asia (IDA & IBRD)', 'Sub-Saharan Africa', 
                'Sub-Saharan Africa (excluding high income)','Sub-Saharan Africa (IDA & IBRD countries)', 
                'Upper middle income', 'World']

We can use `.query()` to remove the non-countries from the data, but in this case there are complications due to the space in the name of the column `Country Name` and the use of an external list. So here let's use an alternative method:

First, apply the `.isin(noncountries)` method to the `Country Name` column of the UN data to create a series of values that are `True` if the `Country Name` on a row is one of the non-countries, and `False` otherwise. Second, use the `~` operator to negate the logical values: turn `True` to `False` and vice versa. Finally, pass this logical series to the `.loc[]` attribute of the dataframe to drop the rows that refer to these noncountries from the UN data. (1 point)

(If you wanted to use `.query()`, you would first need to rename `Country Name` to remove the space, then you can use an `@` in front of `noncountries` to refer to the external list. But for this problem follow the instructions listed above.)

In [6]:
undata = undata.loc[~undata["Country Name"].isin(noncountries)]
undata.shape

(651, 60)

### Part c
Reshape the UN data to move the years from the columns to the rows. (Once the years are in the rows, they will have values such as "1960 [YR1960]".) (2 points)

In [7]:
undata = pd.melt(undata, id_vars = ['Series Name', 'Series Code', 'Country Name', 'Country Code'], 
        value_vars = ['1960 [YR1960]', '1961 [YR1961]', '1962 [YR1962]', '1963 [YR1963]',
                      '1964 [YR1964]', '1965 [YR1965]', '1966 [YR1966]', '1967 [YR1967]',
                      '1968 [YR1968]', '1969 [YR1969]', '1970 [YR1970]', '1971 [YR1971]',
                      '1972 [YR1972]', '1973 [YR1973]', '1974 [YR1974]', '1975 [YR1975]',
                      '1976 [YR1976]', '1977 [YR1977]', '1978 [YR1978]', '1979 [YR1979]',
                      '1980 [YR1980]', '1981 [YR1981]', '1982 [YR1982]', '1983 [YR1983]',
                      '1984 [YR1984]', '1985 [YR1985]', '1986 [YR1986]', '1987 [YR1987]',
                      '1988 [YR1988]', '1989 [YR1989]', '1990 [YR1990]', '1991 [YR1991]',
                      '1992 [YR1992]', '1993 [YR1993]', '1994 [YR1994]', '1995 [YR1995]',
                      '1996 [YR1996]', '1997 [YR1997]', '1998 [YR1998]', '1999 [YR1999]',
                      '2000 [YR2000]', '2001 [YR2001]', '2002 [YR2002]', '2003 [YR2003]',
                      '2004 [YR2004]', '2005 [YR2005]', '2006 [YR2006]', '2007 [YR2007]',
                      '2008 [YR2008]', '2009 [YR2009]', '2010 [YR2010]', '2011 [YR2011]',
                      '2012 [YR2012]', '2013 [YR2013]', '2014 [YR2014]'])
undata.head()

,Series Name,Series Code,Country Name,Country Code,variable,value
0,"Physicians (per 1,000 people)",SH.MED.PHYS.ZS,Afghanistan,AFG,1960 [YR1960],0.0348442494869232
1,"Physicians (per 1,000 people)",SH.MED.PHYS.ZS,Albania,ALB,1960 [YR1960],0.276291221380234
2,"Physicians (per 1,000 people)",SH.MED.PHYS.ZS,Algeria,DZA,1960 [YR1960],0.173148155212402
3,"Physicians (per 1,000 people)",SH.MED.PHYS.ZS,American Samoa,ASM,1960 [YR1960],NaN
4,"Physicians (per 1,000 people)",SH.MED.PHYS.ZS,Andorra,ADO,1960 [YR1960],NaN

### Part d
Rename the `variable` column to `year`. Then use string methods to remove the ends such as "[YR1960]" from the values of the new `year` column and convert the column to an integer data type.

Also, for whatever reason, real world data often contains multiple variables that are just different representations of the same information. In this case, the `Series Name` and `Series Code` variables tell us exactly the same thing, and the `Country Name` and `Country Code` variables tell us exactly the same thing. Unless I have a very good reason to keep both, I generally prefer to drop variables that are redundant and coded in a less helpful way. So drop `Series Code` and `Country Code`. (2 points)

In [8]:
undata = undata.rename({"variable": "year"}, axis = 1)
undata.year = undata.year.str[0:4]
undata.year = undata.year.astype('int64')
undata.drop(['Series Code', 'Country Code'], axis = 1, inplace = True)
undata.head()

                     Series Name    Country Name  year               value
0  Physicians (per 1,000 people)     Afghanistan  1960  0.0348442494869232
1  Physicians (per 1,000 people)         Albania  1960   0.276291221380234
2  Physicians (per 1,000 people)         Algeria  1960   0.173148155212402
3  Physicians (per 1,000 people)  American Samoa  1960                 NaN
4  Physicians (per 1,000 people)         Andorra  1960                 NaN

### Part e
Reshape the data to move the values of `Series Name` to separate columns. Make sure all of the columns exist in the dataframe after reshaping and are not stored in a row index or multi-index. Then rename the columns so that all of the columns have concise and descriptive names. (2 points)

In [9]:
undata.value = undata.value.astype('float')
undata = undata.pivot_table(index = ["Country Name", "year"], columns = ["Series Name"], values = 'value').reset_index()
undata = undata.rename({"Country Name": "country_name",
                        "Health expenditure per capita (current US$)": "Health Expenditure",
                        "Physicians (per 1,000 people)": "Physicians",
                        "Prevalence of undernourishment (% of population)": "Undernourishment"}, axis = 1)
undata.head()

Series Name,country_name,year,Health Expenditure,Physicians,Undernourishment
0,Afghanistan,1960,NaN,0.034844,NaN
1,Afghanistan,1965,NaN,0.063428,NaN
2,Afghanistan,1970,NaN,0.064900,NaN
3,Afghanistan,1981,NaN,0.077000,NaN
4,Afghanistan,1986,NaN,0.183100,NaN

### Part f
Next we are going to join the cleaned UN data with the VDem data. In a perfect world, both datasets would include a shared numeric country ID field that we can use to match countries in one dataset to countries in the other. Unfortunately the UN data identifies the countries only by name. Worse still, while there is a big overlap the two datasets cover different sets of countries.

First decide whether this merge is a one-to-one, one-to-many, many-to-one, or many-to-many merge and describe your rationale in words.

Then perform a test merge that checks whether your expectation that the merge is one-to-one, one-to-many, many-to-one, or many-to-many is confirmed, and reports whether each row is matched, appears only in the UN data, or appears only in the VDem data. Use the `.unique()` or `.value_counts()` method to display the names of the countries that are not matched. (2 points)

**Answer:**
This is a one-to-one match with the keys being country name and year because we should be able to match the values by country and value between the two data frames.

In [10]:
merge_test = pd.merge(undata, VDem, 
                      on = ['country_name', 'year'], 
                      how = 'outer', 
                      indicator = 'matched', 
                      validate = 'one_to_one')
merge_test.query("matched!='both'")['country_name'].unique()

array(['Albania', 'American Samoa', 'Andorra', 'Angola',
       'Antigua and Barbuda', 'Armenia', 'Aruba', 'Austria', 'Azerbaijan',
       'Bahamas, The', 'Bahrain', 'Bangladesh', 'Belarus', 'Belize',
       'Bermuda', 'Bosnia and Herzegovina', 'Brunei Darussalam',
       'Cabo Verde', 'Cameroon', 'Cayman Islands',
       'Central African Republic', 'Chad', 'Channel Islands', 'Comoros',
       'Congo, Dem. Rep.', 'Congo, Rep.', "Cote d'Ivoire", 'Croatia',
       'Cyprus', 'Czech Republic', 'Djibouti', 'Dominica', 'Ecuador',
       'Egypt, Arab Rep.', 'Equatorial Guinea', 'Estonia', 'France',
       'French Polynesia', 'Gabon', 'Gambia, The', 'Georgia', 'Greece',
       'Greenland', 'Grenada', 'Guam', 'Guatemala', 'Guinea',
       'Guinea-Bissau', 'Haiti', 'Honduras', 'Hong Kong SAR, China',
       'Hungary', 'Iceland', 'Iran, Islamic Rep.', 'Ireland', 'Israel',
       'Italy', 'Jamaica', 'Kazakhstan', 'Kiribati',
       'Korea, Dem. Peopleâ€™s Rep.', 'Korea, Rep.', 'Kuwait',
       'Kyrgyz Republic', 'Lao PDR', 'Latvia', 'Lesotho', 'Liberia',
       'Lithuania', 'Luxembourg', 'Macao SAR, China', 'Macedonia, FYR',
       'Madagascar', 'Malaysia', 'Mali', 'Malta', 'Marshall Islands',
       'Mauritania', 'Micronesia, Fed. Sts.', 'Moldova', 'Monaco',
       'Montenegro', 'Myanmar', 'Nauru', 'New Caledonia', 'New Zealand',
       'Nicaragua', 'Niger', 'Northern Mariana Islands', 'Oman', 'Palau',
       'Panama', 'Puerto Rico', 'Russian Federation', 'Samoa',
       'San Marino', 'Sao Tome and Principe', 'Saudi Arabia', 'Senegal',
       'Serbia', 'Seychelles', 'Sierra Leone', 'Singapore',
       'Slovak Republic', 'Slovenia', 'St. Kitts and Nevis', 'St. Lucia',
       'St. Vincent and the Grenadines', 'Swaziland',
       'Syrian Arab Republic', 'Tajikistan', 'Timor-Leste', 'Togo',
       'Tonga', 'Trinidad and Tobago', 'Turkmenistan', 'Tuvalu',
       'Ukraine', 'United Arab Emirates', 'United Kingdom', 'Uzbekistan',
       'Venezuela, RB', 'Vietnam', 'Virgin Islands (U.S.)',
       'West Bank and Gaza', 'Yemen, Rep.', 'Mexico', 'Suriname',
       'Sweden', 'Ghana', 'South Africa', 'Japan', 'Burma_Myanmar',
       'Russia', 'Egypt', 'Yemen', 'Colombia', 'Brazil', 'United States',
       'El Salvador', 'South Yemen', 'Bolivia', 'Pakistan', 'Peru',
       'South Sudan', 'Sudan', 'Vietnam_Democratic Republic of',
       'Vietnam_Republic of', 'Afghanistan', 'Argentina', 'Ethiopia',
       'India', 'Kenya', 'Korea_North', 'Korea_South', 'Kosovo',
       'Lebanon', 'Nigeria', 'Philippines', 'Tanzania', 'Taiwan',
       'Thailand', 'Uganda', 'Venezuela', 'Benin', 'Bhutan',
       'Burkina Faso', 'Cambodia', 'Indonesia', 'Mozambique', 'Nepal',
       'Zambia', 'Zimbabwe', 'Ivory Coast', 'Canada', 'Australia',
       'Botswana', 'Burundi', 'Cape Verde', 'Chile', 'Costa Rica',
       'East Timor', 'Germany', 'Iran', 'Iraq', 'Jordan', 'Malawi',
       'Maldives', 'Mongolia', 'Morocco', 'Netherlands',
       'Papua New Guinea', 'Qatar', 'Spain', 'Syria', 'Tunisia',
       'Uruguay', 'Algeria', 'China', 'Congo_Democratic Republic of',
       'Congo_Republic of the', 'Dominican Republic', 'Eritrea', 'Gambia',
       'Kyrgyzstan', 'Laos', 'Libya', 'Namibia', 'Palestine_West_Bank',
       'Rwanda', 'Somalia', 'Sri Lanka', 'German Democratic Republic',
       'Palestine_Gaza', 'Somaliland', 'Barbados', 'Belgium', 'Bulgaria',
       'Cuba', 'Denmark', 'Fiji', 'Finland', 'Guyana', 'Macedonia',
       'Mauritius', 'Norway', 'Paraguay', 'Romania', 'Slovakia',
       'Solomon Islands', 'Vanuatu'], dtype=object)

### Part g
There are many unmatched rows in this merge. There are three reasons why rows failed to match:
* Differences in geographical coverage: for example, the VDem data includes Taiwan, but the UN data does not
* Differences in time coverage: for example, the UN data includes records for France every year from 1970 through 2014, and VDem includes rows for France from 1960 to 2012, leaving 12 rows for France without matching years
* Differences in spelling: for example, South Korea is called "Korea, Rep." in the UN data and "Korea_South" in the VDem data.

We can't do anything about differences in geographic or temporal coverage. But we can recode some country names to account for differences in spelling and to match more rows that should match. Here is a list of differently spelled countries:

* "Burma_Myanmar" in VDem is "Myanmar" in the UN data
* "Cape Verde" in VDem is "Cabo Verde" in the UN data
* "Congo_Democratic Republic of" in VDem is "Congo, Dem. Rep." in the UN data
* "Congo_Republic of the" in VDem is "Congo, Rep." in the UN data
* "East Timor" in VDem is "Timor-Leste" in the UN data
* "Egypt" in VDem is "Egypt, Arab Rep." in the UN data
* "Gambia" in VDem is "Gambia, The" in the UN data
* "Iran" in VDem is "Iran, Islamic Rep." in the UN data
* "Ivory Coast" in VDem is "Cote d’Ivoire" in the UN data
* "Korea_North" in VDem is "Korea, Dem. People’s Rep." in the UN data
* "Korea_South" in VDem is "Korea, Rep." in the UN data
* "Kyrgyzstan" in VDem is "Kyrgyz Republic" in the UN data
* "Laos" in VDem is "Lao PDR" in the UN data
* "Macedonia" in VDem is "Macedonia, FYR" in the UN data
* "Palestine_West_Bank" in VDem is "West Bank and Gaza" in the UN Data (there is also "Palestine_Gaza" in VDem, but since the UN combines data for the West Bank and Gaza, let's just use "Palestine_West_Bank" for this assignment)
* "Russia" in VDem is "Russian Federation" in the UN data
* "Slovakia" in VDem is "Slovak Republic" in the UN data
* "Syria" in VDem is "Syrian Arab Republic" in the UN data
* "Venezuela" in VDem is "Venezuela, RB" in the UN data
* "Vietnam_Democratic Republic of" in VDem is "Vietnam" in the UN data
* "Yemen" in VDem is "Yemen, Rep." in the UN data

Recode the country names listed above in one of the two dataframes to match the names in the other dataframe. Then perform an inner join of the two dataframes. Some rows will be dropped because of differences in coverage, but no rows will be dropped because of differences in spelling. (2 points)

In [11]:
## Create a map to replace the values
replace_map = {"Myanmar": "Burma_Myanmar",
               "Cabo Verde": "Cape Verde",
               "Congo, Dem. Rep.": "Congo_Democratic Republic of",
               "Congo, Rep.": "Congo_Republic of the",
               "Timor-Leste": "East Timor",
               "Egypt, Arab Rep.": "Egypt",
               "Gambia, The": "Gambia",
               "Iran, Islamic Rep.": "Iran",
               "Cote d’Ivoire": "Ivory Coast",
               "Korea, Dem. People’s Rep.": "Korea_North",
               "Korea, Rep.": "Korea_South",
               "Kyrgyz Republic": "Kyrgyzstan",
               "Lao PDR": "Laos",
               "Macedonia, FYR": "Macedonia",
               "West Bank and Gaza": "Palestine_West_Bank",
               "Russian Federation": "Russia",
               "Slovak Republic": "Slovakia",
               "Syrian Arab Republic": "Syria",
               "Venezuela, RB": "Venezuela",
               "Vietnam": "Vietnam_Democratic Republic of",
               "Yemen, Rep.": "Yemen"}

## Replace the values
undata.country_name = undata.country_name.replace(replace_map)
merge_final = pd.merge(undata, VDem, 
                       on = ['country_name', 'year'], 
                       how = 'inner', 
                       indicator = 'matched', 
                       validate = 'one_to_one')
# Check
# merge_final.query("matched!='both'")['country_name'].unique()
merge_final.head()

,country_name,year,Health Expenditure,Physicians,Undernourishment,X1,country_id,country_text_id,historical_date,codingstart,...,v2xcs_ccsi_codelow,v2xps_party,v2xps_party_codehigh,v2xps_party_codelow,v2x_gender,v2x_gender_codehigh,v2x_gender_codelow,v2x_gencl,v2x_gencl_codehigh,matched
0,Afghanistan,1960,NaN,0.034844,NaN,1583,36,AFG,1960-01-01,1900,...,0.143550,0.074516,0.162687,0.028557,0.181335,0.232855,0.129815,0.172381,0.301402,both
1,Afghanistan,1965,NaN,0.063428,NaN,1588,36,AFG,1965-01-01,1900,...,0.288714,0.177830,0.304231,0.090927,0.215910,0.277255,0.154566,0.201414,0.350518,both
2,Afghanistan,1970,NaN,0.064900,NaN,1593,36,AFG,1970-01-01,1900,...,0.271911,0.177830,0.304231,0.090927,0.211898,0.268672,0.155124,0.201414,0.350518,both
3,Afghanistan,1981,NaN,0.077000,NaN,1604,36,AFG,1981-01-01,1900,...,0.023951,0.143448,0.254819,0.070712,0.209011,0.273436,0.144586,0.222300,0.369985,both
4,Afghanistan,1986,NaN,0.183100,NaN,1609,36,AFG,1986-01-01,1900,...,0.023951,0.143448,0.254819,0.070712,0.209011,0.273436,0.144586,0.222300,0.369985,both

## Problem 2
[Kickstarter](https://www.kickstarter.com/) is a website in which people can pledge financial support for creative projects. Patrons are only charged if a project raises enough money to meet a pre-specified goal, and projects can offer items as "rewards" for patrons who contribute at particular levels. One interesting aspect of Kickstarter is the ability to [search projects by "ending soon"](https://www.kickstarter.com/discover/advanced?sort=end_date). If you have a few dollars to spare and want to feel like a hero, you can swoop in at the last minute to contribute enough for a project to meet its goal.

Cathie So created a project on Kaggle in which she [scraped Kickstarter](https://www.kaggle.com/socathie/kickstarter-project-statistics/data?select=live.csv) and collected data on 4000 live projects (projects that were currently collecting pledges from patrons) as of October 10, 2016, at 5pm Pacific time. The data are here:

In [12]:
kickstarter = pd.read_csv("https://github.com/jkropko/DS-6001/raw/master/localdata/live.csv")
kickstarter

,Unnamed: 0,amt.pledged,blurb,by,country,currency,end.time,location,percentage.funded,state,title,type,url
0,0,15823.0,"\n'Catalysts, Explorers & Secret Keepers: Wome...",Museum of Science Fiction,US,usd,2016-11-01T23:59:00-04:00,"Washington, DC",186,DC,"Catalysts, Explorers & Secret Keepers: Women o...",Town,/projects/1608905146/catalysts-explorers-and-s...
1,1,6859.0,\nA unique handmade picture book for kids & ar...,"Tyrone Wells & Broken Eagle, LLC",US,usd,2016-11-25T01:13:33-05:00,"Portland, OR",8,OR,The Whatamagump (a hand-crafted story picture ...,Town,/projects/thewhatamagump/the-whatamagump-a-han...
2,2,17906.0,\nA horror comedy about a repairman who was in...,Tessa Stone,US,usd,2016-11-23T23:00:00-05:00,"Los Angeles, CA",102,CA,Not Drunk Enough Volume 1!,Town,/projects/1890925998/not-drunk-enough-volume-1...
3,3,67081.0,\nThe Johnny Wander autobio omnibus you've all...,Johnny Wander,US,usd,2016-11-01T23:50:00-04:00,"Brooklyn, NY",191,NY,Our Cats Are More Famous Than Us: A Johnny Wan...,County,/projects/746734715/our-cats-are-more-famous-t...
4,4,32772.0,\nThe vision for this project is the establish...,Beau's All Natural Brewing Company,RW,cad,2016-11-18T23:05:48-05:00,"Kigali, Rwanda",34,Kigali Province,The Rwanda Craft Brewery Project,Town,/projects/beaus/the-rwanda-craft-brewery-proje...
...,...,...,...,...,...,...,...,...,...,...,...,...,...
3995,3995,4403.0,\nEARTH IS BUT ONE FRUIT ON THE TREE OF LIFE. ...,Lewis Brown,US,usd,2016-11-20T01:10:00-05:00,"Denver, CO",88,CO,BROWN HORNET OMNIVERSE,Town,/projects/brownhornetomni/brown-hornet-omniver...
3996,3996,1304.0,\nImagine designing an item with an easy-to-us...,Your Expressions,US,usd,2016-11-15T16:00:00-05:00,"San Francisco, CA",5,CA,3D Pixie - App to Design Personalized Jewelry,Town,/projects/yourexpressions/3d-pixie-app-to-crea...
3997,3997,1.0,\nUnique themed London venue and hostel for 9g...,Martin Wojtala,GB,gbp,2016-10-30T09:36:06-04:00,"London, UK",0,England,9HUB - London,Town,/projects/1132099243/9hub-london?ref=discovery
3998,3998,10.0,\nAll in One Phone Case\n,All in One Phone Case,US,usd,2016-11-17T12:11:26-05:00,"Tallahassee, FL",0,FL,All in One Phone Case,Town,/projects/203104559/all-in-one-phone-case?ref=...
3999,3999,35.0,"\nLuxury Sunglasses built with Titanium, Carbo...",Carlos Araujo,US,usd,2016-12-11T00:11:01-05:00,"New York, NY",0,NY,Edward & Lux- Classic & Timeless Aviator Sungl...,Town,/projects/1833705733/edward-and-lux-classic-an...

### Part a
Notice that the `end.time` column, the date and time at which the project stops accepting pledges, is formatted as follows:
```
2016-11-01T23:59:00-04:00
```
This formatting is "YYYY-MM-DDThh:mm:ss-TZD": four digits for the year, a dash, two digits for the month, another dash, and two digits for the day; the "T" separates the dates from the time; two digits for the hour, minute and second, separated by colons; and the time zone expressed as hours difference from Greenwich mean time (also called UTC), and -04:00 is four hours earlier than UTC, for example.

But `end.time` is also currently read as a string, with `object` data type:

In [13]:
kickstarter.dtypes

Unnamed: 0             int64
amt.pledged          float64
blurb                 object
by                    object
country               object
currency              object
end.time              object
location              object
percentage.funded      int64
state                 object
title                 object
type                  object
url                   object
dtype: object

Convert `end.time` to a timestamp, and extract the month, day, year, hour, minute, and second of the end time. To allow the `pd.to_datetime()` function to read timezones, use the `utc=True` argument. (2 points)

In [14]:
# Convert end.time to a date time format
kickstarter['end.time'] = pd.to_datetime(kickstarter['end.time'], utc=True)

# Extract different time component of the date time 
kickstarter['month'] = [x.month for x in kickstarter['end.time']]
kickstarter['day'] = [x.day for x in kickstarter['end.time']]
kickstarter['year'] = [x.year for x in kickstarter['end.time']]
kickstarter['hour'] = [x.hour for x in kickstarter['end.time']]
kickstarter['minute'] = [x.minute for x in kickstarter['end.time']]
kickstarter['second'] = [x.second for x in kickstarter['end.time']]

kickstarter.head()

,Unnamed: 0,amt.pledged,blurb,by,country,currency,end.time,location,percentage.funded,state,title,type,url,month,day,year,hour,minute,second
0,0,15823.0,"\n'Catalysts, Explorers & Secret Keepers: Wome...",Museum of Science Fiction,US,usd,2016-11-02 03:59:00+00:00,"Washington, DC",186,DC,"Catalysts, Explorers & Secret Keepers: Women o...",Town,/projects/1608905146/catalysts-explorers-and-s...,11,2,2016,3,59,0
1,1,6859.0,\nA unique handmade picture book for kids & ar...,"Tyrone Wells & Broken Eagle, LLC",US,usd,2016-11-25 06:13:33+00:00,"Portland, OR",8,OR,The Whatamagump (a hand-crafted story picture ...,Town,/projects/thewhatamagump/the-whatamagump-a-han...,11,25,2016,6,13,33
2,2,17906.0,\nA horror comedy about a repairman who was in...,Tessa Stone,US,usd,2016-11-24 04:00:00+00:00,"Los Angeles, CA",102,CA,Not Drunk Enough Volume 1!,Town,/projects/1890925998/not-drunk-enough-volume-1...,11,24,2016,4,0,0
3,3,67081.0,\nThe Johnny Wander autobio omnibus you've all...,Johnny Wander,US,usd,2016-11-02 03:50:00+00:00,"Brooklyn, NY",191,NY,Our Cats Are More Famous Than Us: A Johnny Wan...,County,/projects/746734715/our-cats-are-more-famous-t...,11,2,2016,3,50,0
4,4,32772.0,\nThe vision for this project is the establish...,Beau's All Natural Brewing Company,RW,cad,2016-11-19 04:05:48+00:00,"Kigali, Rwanda",34,Kigali Province,The Rwanda Craft Brewery Project,Town,/projects/beaus/the-rwanda-craft-brewery-proje...,11,19,2016,4,5,48

### Part b
Create a dataframe with one row for every ending day in the `kickstarter` data that reports the average amount pledged (`amt.pledged`) on each day. Sort the rows in descending order by average amount pledged, and display the five days with the highest averages. (2 points)

In [15]:
kickstarter[['day', 'amt.pledged']].\
    groupby(['day']).mean().\
    reset_index().\
    sort_values(by = 'amt.pledged', ascending = False).\
    head(5)

    day   amt.pledged
3     4  22503.383117
10   11  22015.356250
17   18  19555.572368
4     5  16316.441176
13   14  14540.920000

### Part c
Display the text of the longest `blurb` in the data. (2 points)

In [16]:
# Count the number of characters of each blurb
kickstarter.insert(0, 'blurb_length', [len(x) for x in kickstarter.blurb])
kickstarter[['blurb_length', 'blurb']][kickstarter['blurb_length'] == max(kickstarter['blurb_length'])]

      blurb_length                                              blurb
1              137  \nA unique handmade picture book for kids & ar...
32             137  \nDeluxe Mac&Cheese Kits that are as good as h...
37             137  \nAndy Irons, 3-time world champion surfer who...
56             137  \nMy Name Is Stardust was inspired by what Nei...
58             137  \nImmortal Prosperity is a premium, highly-det...
...            ...                                                ...
3970           137  \nA business solution for rural villages. Prod...
3979           137  \nMedicinal/antimicrobial honey, made from nat...
3992           137  \nThe Home Book, Write down and upload picture...
3993           137  \nThe on-the-go Magnetic pocket that everyone ...
3996           137  \nImagine designing an item with an easy-to-us...

[432 rows x 2 columns]

In [17]:
# Given there is a tie of total number of characters, here I am just going to show the first one
kickstarter[['blurb_length', 'blurb']][kickstarter['blurb_length'] == max(kickstarter['blurb_length'])].iloc[0,1]

'\nA unique handmade picture book for kids & art lovers about a nervous monster who finds his courage with the help of a brave little girl\n'

### Part d
How many blurbs for projects with end dates between November 15, 2016 and December 7, 2016 contain the phrase "science fiction"? [Hint: Don't forget to make this search case-insensitive and to sort the `kickstarter` dataframe by `end.time` before setting `end.time` as the index.] (2 points)

In [18]:
# Sort by end.time
kickstarter = kickstarter.sort_values(by = "end.time")
# Use end.time as an index
kickstarter.index = kickstarter['end.time']
# Find the number of blurbs that contains science fiction in the time period selected
kickstarter['11/15/2016':'12/07/2016'].blurb.str.lower().str.contains('science fiction').sum()

6